/* eslint-disable */
"use client"

import BgImage from "../assets/black-wall-with-golden-cracks.webp";
//@ts-ignore
import Slider from "@madzadev/image-slider";
import "@madzadev/image-slider/dist/index.css";
import useWindowDimensions from "@/hooks/useDimensions";
import dynamic from 'next/dynamic'
export default function Home() {
  const { width, height} = useWindowDimensions()
  const images = [
    { url: "https://picsum.photos/seed/a/1600/900" },
    { url: "https://picsum.photos/seed/b/1920/1080" },
    { url: "https://picsum.photos/seed/c/1366/768" },
  ];
  return (
    <div>
      <main
        className="w-full h-full min-h-[100vh] bg-white"
 
      >
        {/* <Image
          aria-hidden
          src={BgImage}
          alt="File icon"
          fill
          className="!w-[100%] !h-[100%] z-10 "
        /> */}
        <div className="z-50">
          <h1 className="text-center text-white font-bold py-5 text-[20px] md:text-[80px]">‚‚Missing values‘‘</h1>
          <h1 className="text-center text-white font-bold text-[20px] md:text-[80px]">
            ‚‚Исчезнати вредности 2025‘‘
          </h1>
        </div>

        <div className="text-[16px] py-[100px] px-4 md:px-[100px]">

          <p className="text-white">
          ,, Исчезнати вредности “ е интерактивно,  мултидисциплинарно дело со наративна трансформација и е последователно дело на ,, Игралиште “2023, кое беше изложено на отворањето на Europe House Veles и ,,Галерија под отворено небо’’, всушност е постепена еволуција на концептот и уметничкиот израз. 
Во свет каде што човечноста е во постојан судир со суровите барања на материјализмот, прашањето за вредностите што ги носиме како луѓе станува сè порелевантно и повознемирувачко. Во овој контекст, темата на исчезнатите деца не е само емотивен повик, туку и длабока морална рефлексија која нè принудува да се соочиме со сопствените слабости и општествени компромиси.
Децата се носители на нашата надеж и нашето утре. Тие се суштината на нашето битисување, симбол на невиноста, љубовта и потенцијалот за доброто. Но, нивната вредност е бескрајна токму затоа што не може да се измери или спореди. Во секој детски поглед, насмевка или солза е впишана приказната за иднината што ја создаваме. А сепак, во светот опседнат со профит, капитал и материјален успех, овие норми често се потиснуваат или се губат во сенката на нечовечноста и  вандализмот. На естетско ниво, децата се најчистиот израз на убавината на животот. Нивната игра, радост и нивната љубопитност нè потсетуваат на суштината на човечката душа, која е многу повеќе од материјалното. Но, кога светот се претвора во бездушна машина за профит, дури и нивната убавина се девалвира.
Нечовечноста се манифестира низ многу облици: трговија со луѓе, занемарување на потребите, експлоатација, но и низ суптилни општествени девијации што ја нормализираат идејата дека сè може да се претвори во стока. Исчезнатите деца, со нивните приказни исполнети со болка и неправда, не се само трагедии на индивидуално ниво; тие се и симбол на нашата колективна неспособност да ги зачуваме најважните аспекти на нашето постоење.
Дали може да се одреди вредноста на едно дете? Љубовта, емпатијата и заштитата нè обврзуваат да го почитуваме и штитиме нивното право на живот, среќа и безбедност, а не да ги дефинираме како економска и политичка придобивка.
Како родител кој е свесен за суровата реалност и тековните случувања на глобално ниво, како просветен работник кој секојдневно е директно инволвиран во животите на голем број деца, сум свесна за опасноста која може да ги одреди судбините на сите нас. 
Поттикот за изработка на ова дело е текстот ,, Одкупувам органи 065.432.178 ” на автобуската постојка на главната улица во населбата каде што живеам и го гледам секојдневно по неколку пати.
Преку делото се поставувам себе си во улога на креатор на настани кои би можеле да се случат доколку правилно се изменторирани во различни аспекти препишувајќи ги пропустите на општествениот систем низ иницијален импулс за соочување со колективната индиферентност и апатија пред замижаните очи на јавноста, во обид да се заштити емоционалната и психичката благосостојба на поединците и заедницата. Се стремам да поттикнам критичко согледување на општествените структури, доминантните наративи, институционалните пропусти и социјалната девијација, како и да ја иницирам дискусијата за потребата од промена на законските рамки и функционирањето на институциите, а истовремено да влијаам на колективната свест и општествената трансформација.“
Успешно уметничко дело е тоа што ќе те натера да размислуваш повеќе пати во текот на денот, месецот, годината...кога возиш, кога јадеш, пред да заспеш... оваа реченица прв ми ја кажа татко ми.
          </p>
        </div>
       {width &&  <div className="bg-white py-2">
        <Slider imageList={images} width={width} height={700} />
        </div>}
       <div className="my-10">
       <h2 className="text-[20px] text-white font-bold text-center">Artist: Elena Dimova Pantelikj</h2>
       <h2 className="text-[20px] text-white text-center">Artwork "Missing Values 2025"</h2>
       </div>

     
      </main>
      <footer className="row-start-3 flex gap-6 flex-wrap items-center justify-center">
        <a
          className=" w-[200px] bg-green text-white rounded-[8px] text-center py-2"
          href="/biography"
          rel="noopener noreferrer"
        >
          Read Biography {">"}{">"}
        </a>
     
       
      </footer>
    </div>
  );
}
